hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_mmc_regs.h
/* Bitfield definition for register: INT_EN */
/*
 * SPEED_TRG_VLD_IE (RW)
 *
 * Interrupt Enable for SPEED_TRG_VALID
 */
#define MMC_INT_EN_SPEED_TRG_VLD_IE_MASK (0x400U)
#define MMC_INT_EN_SPEED_TRG_VLD_IE_SHIFT (10U)
#define MMC_INT_EN_SPEED_TRG_VLD_IE_SET(x) (((uint32_t)(x) << MMC_INT_EN_SPEED_TRG_VLD_IE_SHIFT) & MMC_INT_EN_SPEED_TRG_VLD_IE_MASK)
#define MMC_INT_EN_SPEED_TRG_VLD_IE_GET(x) (((uint32_t)(x) & MMC_INT_EN_SPEED_TRG_VLD_IE_MASK) >> MMC_INT_EN_SPEED_TRG_VLD_IE_SHIFT)

/*
 * POS_TRG_VLD_IE (RW)
 *
 * Interrupt Enable for POS_TRG_VALID
 */
#define MMC_INT_EN_POS_TRG_VLD_IE_MASK (0x200U)
#define MMC_INT_EN_POS_TRG_VLD_IE_SHIFT (9U)
#define MMC_INT_EN_POS_TRG_VLD_IE_SET(x) (((uint32_t)(x) << MMC_INT_EN_POS_TRG_VLD_IE_SHIFT) & MMC_INT_EN_POS_TRG_VLD_IE_MASK)
#define MMC_INT_EN_POS_TRG_VLD_IE_GET(x) (((uint32_t)(x) & MMC_INT_EN_POS_TRG_VLD_IE_MASK) >> MMC_INT_EN_POS_TRG_VLD_IE_SHIFT)

/*
 * INI_DELTA_POS_REQ_CMD_DONE_IE (RW)
 *
 * Interrupt Enable for INI_DELTA_POS_REQ_CMD_DONE
 */
#define MMC_INT_EN_INI_DELTA_POS_REQ_CMD_DONE_IE_MASK (0x100U)
#define MMC_INT_EN_INI_DELTA_POS_REQ_CMD_DONE_IE_SHIFT (8U)
#define MMC_INT_EN_INI_DELTA_POS_REQ_CMD_DONE_IE_SET(x) (((uint32_t)(x) << MMC_INT_EN_INI_DELTA_POS_REQ_CMD_DONE_IE_SHIFT) & MMC_INT_EN_INI_DELTA_POS_REQ_CMD_DONE_IE_MASK)
#define MMC_INT_EN_INI_DELTA_POS_REQ_CMD_DONE_IE_GET(x) (((uint32_t)(x) & MMC_INT_EN_INI_DELTA_POS_REQ_CMD_DONE_IE_MASK) >> MMC_INT_EN_INI_DELTA_POS_REQ_CMD_DONE_IE_SHIFT)

/*
 * INI_BR0_POS_REQ_CMD_DONE_IE (RW)
 *
 * Interrupt Enable for INI_BR0_POS_REQ_CMD_DONE
 */
#define MMC_INT_EN_INI_BR0_POS_REQ_CMD_DONE_IE_MASK (0x80U)
#define MMC_INT_EN_INI_BR0_POS_REQ_CMD_DONE_IE_SHIFT (7U)
#define MMC_INT_EN_INI_BR0_POS_REQ_CMD_DONE_IE_SET(x) (((uint32_t)(x) << MMC_INT_EN_INI_BR0_POS_REQ_CMD_DONE_IE_SHIFT) & MMC_INT_EN_INI_BR0_POS_REQ_CMD_DONE_IE_MASK)
#define MMC_INT_EN_INI_BR0_POS_REQ_CMD_DONE_IE_GET(x) (((uint32_t)(x) & MMC_INT_EN_INI_BR0_POS_REQ_CMD_DONE_IE_MASK) >> MMC_INT_EN_INI_BR0_POS_REQ_CMD_DONE_IE_SHIFT)

/*
 * INI_BR1_POS_REQ_CMD_DONE_IE (RW)
 *
 * Interrupt Enable for INI_BR1_POS_REQ_CMD_DONE
 */
#define MMC_INT_EN_INI_BR1_POS_REQ_CMD_DONE_IE_MASK (0x40U)
#define MMC_INT_EN_INI_BR1_POS_REQ_CMD_DONE_IE_SHIFT (6U)
#define MMC_INT_EN_INI_BR1_POS_REQ_CMD_DONE_IE_SET(x) (((uint32_t)(x) << MMC_INT_EN_INI_BR1_POS_REQ_CMD_DONE_IE_SHIFT) & MMC_INT_EN_INI_BR1_POS_REQ_CMD_DONE_IE_MASK)
#define MMC_INT_EN_INI_BR1_POS_REQ_CMD_DONE_IE_GET(x) (((uint32_t)(x) & MMC_INT_EN_INI_BR1_POS_REQ_CMD_DONE_IE_MASK) >> MMC_INT_EN_INI_BR1_POS_REQ_CMD_DONE_IE_SHIFT)

/*
 * OOSYNC_IE (RW)
 *
 * Interrupt Enable for OOSYNC
 */
#define MMC_INT_EN_OOSYNC_IE_MASK (0x10U)
#define MMC_INT_EN_OOSYNC_IE_SHIFT (4U)
#define MMC_INT_EN_OOSYNC_IE_SET(x) (((uint32_t)(x) << MMC_INT_EN_OOSYNC_IE_SHIFT) & MMC_INT_EN_OOSYNC_IE_MASK)
#define MMC_INT_EN_OOSYNC_IE_GET(x) (((uint32_t)(x) & MMC_INT_EN_OOSYNC_IE_MASK) >> MMC_INT_EN_OOSYNC_IE_SHIFT)

/*
 * INI_POS_REQ_CMD_DONE_IE (RW)
 *
 * Interrupt Enable for INI_POS_REQ_CMD_DONE
 */
#define MMC_INT_EN_INI_POS_REQ_CMD_DONE_IE_MASK (0x4U)
#define MMC_INT_EN_INI_POS_REQ_CMD_DONE_IE_SHIFT (2U)
#define MMC_INT_EN_INI_POS_REQ_CMD_DONE_IE_SET(x) (((uint32_t)(x) << MMC_INT_EN_INI_POS_REQ_CMD_DONE_IE_SHIFT) & MMC_INT_EN_INI_POS_REQ_CMD_DONE_IE_MASK)
#define MMC_INT_EN_INI_POS_REQ_CMD_DONE_IE_GET(x) (((uint32_t)(x) & MMC_INT_EN_INI_POS_REQ_CMD_DONE_IE_MASK) >> MMC_INT_EN_INI_POS_REQ_CMD_DONE_IE_SHIFT)

/*
 * INI_COEFS_CMD_DONE_IE (RW)
 *
 * Interrupt Enable for INI_COEFS_CMD_DONE
 */
#define MMC_INT_EN_INI_COEFS_CMD_DONE_IE_MASK (0x2U)
#define MMC_INT_EN_INI_COEFS_CMD_DONE_IE_SHIFT (1U)
#define MMC_INT_EN_INI_COEFS_CMD_DONE_IE_SET(x) (((uint32_t)(x) << MMC_INT_EN_INI_COEFS_CMD_DONE_IE_SHIFT) & MMC_INT_EN_INI_COEFS_CMD_DONE_IE_MASK)
#define MMC_INT_EN_INI_COEFS_CMD_DONE_IE_GET(x) (((uint32_t)(x) & MMC_INT_EN_INI_COEFS_CMD_DONE_IE_MASK) >> MMC_INT_EN_INI_COEFS_CMD_DONE_IE_SHIFT)

/*
 * SHADOW_RD_DONE_IE (RW)
 *
 * Interrupt Enable for SHADOW_RD_DONE
 */
#define MMC_INT_EN_SHADOW_RD_DONE_IE_MASK (0x1U)
#define MMC_INT_EN_SHADOW_RD_DONE_IE_SHIFT (0U)
#define MMC_INT_EN_SHADOW_RD_DONE_IE_SET(x) (((uint32_t)(x) << MMC_INT_EN_SHADOW_RD_DONE_IE_SHIFT) & MMC_INT_EN_SHADOW_RD_DONE_IE_MASK)
#define MMC_INT_EN_SHADOW_RD_DONE_IE_GET(x) (((uint32_t)(x) & MMC_INT_EN_SHADOW_RD_DONE_IE_MASK) >> MMC_INT_EN_SHADOW_RD_DONE_IE_SHIFT)

/* Bitfield definition for register: SYSCLK_FREQ */
/*
 * VAL (RW)
 *
 * system clock frequency, ufix<32, 0>
 */
#define MMC_SYSCLK_FREQ_VAL_MASK (0xFFFFFFFFUL)
#define MMC_SYSCLK_FREQ_VAL_SHIFT (0U)
#define MMC_SYSCLK_FREQ_VAL_SET(x) (((uint32_t)(x) << MMC_SYSCLK_FREQ_VAL_SHIFT) & MMC_SYSCLK_FREQ_VAL_MASK)
#define MMC_SYSCLK_FREQ_VAL_GET(x) (((uint32_t)(x) & MMC_SYSCLK_FREQ_VAL_MASK) >> MMC_SYSCLK_FREQ_VAL_SHIFT)

/* Bitfield definition for register: SYSCLK_PERIOD */
/*
 * VAL (RW)
 *
 * round( the value of clock period * (2^24)*(2^20) ), ufix<32, 0>
 */
#define MMC_SYSCLK_PERIOD_VAL_MASK (0xFFFFFFFFUL)
#define MMC_SYSCLK_PERIOD_VAL_SHIFT (0U)
#define MMC_SYSCLK_PERIOD_VAL_SET(x) (((uint32_t)(x) << MMC_SYSCLK_PERIOD_VAL_SHIFT) & MMC_SYSCLK_PERIOD_VAL_MASK)
#define MMC_SYSCLK_PERIOD_VAL_GET(x) (((uint32_t)(x) & MMC_SYSCLK_PERIOD_VAL_MASK) >> MMC_SYSCLK_PERIOD_VAL_SHIFT)

/* Bitfield definition for register: OOSYNC_THETA_THR */
/*
 * VAL (RW)
 *
 * the threshold of theta difference between actual and prediction for out-of-sync determination，ufix<32, 32>
 */
#define MMC_OOSYNC_THETA_THR_VAL_MASK (0xFFFFFFFFUL)
#define MMC_OOSYNC_THETA_THR_VAL_SHIFT (0U)
#define MMC_OOSYNC_THETA_THR_VAL_SET(x) (((uint32_t)(x) << MMC_OOSYNC_THETA_THR_VAL_SHIFT) & MMC_OOSYNC_THETA_THR_VAL_MASK)
#define MMC_OOSYNC_THETA_THR_VAL_GET(x) (((uint32_t)(x) & MMC_OOSYNC_THETA_THR_VAL_MASK) >> MMC_OOSYNC_THETA_THR_VAL_SHIFT)

/* Bitfield definition for register: DISCRETECFG0 */
/*
 * POSMAX (RW)
 *
 * Max ID Of Lines. For example-1, for 512 lines, it is 511. ufix<32, 0>
 */
#define MMC_DISCRETECFG0_POSMAX_MASK (0xFFFFFUL)
#define MMC_DISCRETECFG0_POSMAX_SHIFT (0U)
#define MMC_DISCRETECFG0_POSMAX_SET(x) (((uint32_t)(x) << MMC_DISCRETECFG0_POSMAX_SHIFT) & MMC_DISCRETECFG0_POSMAX_MASK)
#define MMC_DISCRETECFG0_POSMAX_GET(x) (((uint32_t)(x) & MMC_DISCRETECFG0_POSMAX_MASK) >> MMC_DISCRETECFG0_POSMAX_SHIFT)

/* Bitfield definition for register: DISCRETECFG1 */
/*
 * INV_POSMAX (RW)
 *
 * discrete mode: ufix<32, 0> of 1/(Number Of Lines)
 * continuous mode: the max delta for tracking from the last received position, ufix<32, 32>
 */
#define MMC_DISCRETECFG1_INV_POSMAX_MASK (0xFFFFFFFFUL)
#define MMC_DISCRETECFG1_INV_POSMAX_SHIFT (0U)
#define MMC_DISCRETECFG1_INV_POSMAX_SET(x) (((uint32_t)(x) << MMC_DISCRETECFG1_INV_POSMAX_SHIFT) & MMC_DISCRETECFG1_INV_POSMAX_MASK)
#define MMC_DISCRETECFG1_INV_POSMAX_GET(x) (((uint32_t)(x) & MMC_DISCRETECFG1_INV_POSMAX_MASK) >> MMC_DISCRETECFG1_INV_POSMAX_SHIFT)

/* Bitfield definition for register: CONTCFG0 */
/*
 * HALF_CIRC_THETA (RW)
 *
 * the theta for cal the clockwise or anticlockwise rotation between two adjacent inputs, ufix<32, 32>
 */
#define MMC_CONTCFG0_HALF_CIRC_THETA_MASK (0xFFFFFFFFUL)
#define MMC_CONTCFG0_HALF_CIRC_THETA_SHIFT (0U)
#define MMC_CONTCFG0_HALF_CIRC_THETA_SET(x) (((uint32_t)(x) << MMC_CONTCFG0_HALF_CIRC_THETA_SHIFT) & MMC_CONTCFG0_HALF_CIRC_THETA_MASK)
#define MMC_CONTCFG0_HALF_CIRC_THETA_GET(x) (((uint32_t)(x) & MMC_CONTCFG0_HALF_CIRC_THETA_MASK) >> MMC_CONTCFG0_HALF_CIRC_THETA_SHIFT)

/* Bitfield definition for register: INI_POS_TIME */
/*
 * VAL (RW)
 *
 * indicate the time to change the values.
 * 0: instant change
 */
#define MMC_INI_POS_TIME_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_POS_TIME_VAL_SHIFT (0U)
#define MMC_INI_POS_TIME_VAL_SET(x) (((uint32_t)(x) << MMC_INI_POS_TIME_VAL_SHIFT) & MMC_INI_POS_TIME_VAL_MASK)
#define MMC_INI_POS_TIME_VAL_GET(x) (((uint32_t)(x) & MMC_INI_POS_TIME_VAL_MASK) >> MMC_INI_POS_TIME_VAL_SHIFT)

/* Bitfield definition for register: INI_POS */
/*
 * VAL (RW)
 *
 * the value；
 * continuous mode: ufix<32, 32>
 */
#define MMC_INI_POS_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_POS_VAL_SHIFT (0U)
#define MMC_INI_POS_VAL_SET(x) (((uint32_t)(x) << MMC_INI_POS_VAL_SHIFT) & MMC_INI_POS_VAL_MASK)
#define MMC_INI_POS_VAL_GET(x) (((uint32_t)(x) & MMC_INI_POS_VAL_MASK) >> MMC_INI_POS_VAL_SHIFT)

/* Bitfield definition for register: INI_REV */
/*
 * VAL (RW)
 *
 * the value；
 * continuous mode: ufix<32, 0>
 */
#define MMC_INI_REV_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_REV_VAL_SHIFT (0U)
#define MMC_INI_REV_VAL_SET(x) (((uint32_t)(x) << MMC_INI_REV_VAL_SHIFT) & MMC_INI_REV_VAL_MASK)
#define MMC_INI_REV_VAL_GET(x) (((uint32_t)(x) & MMC_INI_REV_VAL_MASK) >> MMC_INI_REV_VAL_SHIFT)

/* Bitfield definition for register: INI_SPEED */
/*
 * VAL (RW)
 *
 * the value;
 * continuous mode: fix<32, 19>
 */
#define MMC_INI_SPEED_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_SPEED_VAL_SHIFT (0U)
#define MMC_INI_SPEED_VAL_SET(x) (((uint32_t)(x) << MMC_INI_SPEED_VAL_SHIFT) & MMC_INI_SPEED_VAL_MASK)
#define MMC_INI_SPEED_VAL_GET(x) (((uint32_t)(x) & MMC_INI_SPEED_VAL_MASK) >> MMC_INI_SPEED_VAL_SHIFT)

