hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_mmc_regs.h
/* Bitfield definition for register: INI_ACCEL */
/*
 * VAL (RW)
 *
 * the value
 * continuous mode: fix<32, 19>
 */
#define MMC_INI_ACCEL_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_ACCEL_VAL_SHIFT (0U)
#define MMC_INI_ACCEL_VAL_SET(x) (((uint32_t)(x) << MMC_INI_ACCEL_VAL_SHIFT) & MMC_INI_ACCEL_VAL_MASK)
#define MMC_INI_ACCEL_VAL_GET(x) (((uint32_t)(x) & MMC_INI_ACCEL_VAL_MASK) >> MMC_INI_ACCEL_VAL_SHIFT)

/* Bitfield definition for register: INI_COEF_TIME */
/*
 * VAL (RW)
 *
 * indicate the time to change the values.
 * 0: instant change
 */
#define MMC_INI_COEF_TIME_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_COEF_TIME_VAL_SHIFT (0U)
#define MMC_INI_COEF_TIME_VAL_SET(x) (((uint32_t)(x) << MMC_INI_COEF_TIME_VAL_SHIFT) & MMC_INI_COEF_TIME_VAL_MASK)
#define MMC_INI_COEF_TIME_VAL_GET(x) (((uint32_t)(x) & MMC_INI_COEF_TIME_VAL_MASK) >> MMC_INI_COEF_TIME_VAL_SHIFT)

/* Bitfield definition for register: INI_PCOEF */
/*
 * VAL (RW)
 *
 * the value, fix<32, 15>
 */
#define MMC_INI_PCOEF_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_PCOEF_VAL_SHIFT (0U)
#define MMC_INI_PCOEF_VAL_SET(x) (((uint32_t)(x) << MMC_INI_PCOEF_VAL_SHIFT) & MMC_INI_PCOEF_VAL_MASK)
#define MMC_INI_PCOEF_VAL_GET(x) (((uint32_t)(x) & MMC_INI_PCOEF_VAL_MASK) >> MMC_INI_PCOEF_VAL_SHIFT)

/* Bitfield definition for register: INI_ICOEF */
/*
 * VAL (RW)
 *
 * the value, fix<32, 21>
 */
#define MMC_INI_ICOEF_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_ICOEF_VAL_SHIFT (0U)
#define MMC_INI_ICOEF_VAL_SET(x) (((uint32_t)(x) << MMC_INI_ICOEF_VAL_SHIFT) & MMC_INI_ICOEF_VAL_MASK)
#define MMC_INI_ICOEF_VAL_GET(x) (((uint32_t)(x) & MMC_INI_ICOEF_VAL_MASK) >> MMC_INI_ICOEF_VAL_SHIFT)

/* Bitfield definition for register: INI_ACOEF */
/*
 * VAL (RW)
 *
 * the value, fix<32, 19>
 */
#define MMC_INI_ACOEF_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_ACOEF_VAL_SHIFT (0U)
#define MMC_INI_ACOEF_VAL_SET(x) (((uint32_t)(x) << MMC_INI_ACOEF_VAL_SHIFT) & MMC_INI_ACOEF_VAL_MASK)
#define MMC_INI_ACOEF_VAL_GET(x) (((uint32_t)(x) & MMC_INI_ACOEF_VAL_MASK) >> MMC_INI_ACOEF_VAL_SHIFT)

/* Bitfield definition for register: ESTM_TIM */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_ESTM_TIM_VAL_MASK (0xFFFFFFFFUL)
#define MMC_ESTM_TIM_VAL_SHIFT (0U)
#define MMC_ESTM_TIM_VAL_GET(x) (((uint32_t)(x) & MMC_ESTM_TIM_VAL_MASK) >> MMC_ESTM_TIM_VAL_SHIFT)

/* Bitfield definition for register: ESTM_POS */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_ESTM_POS_VAL_MASK (0xFFFFFFFFUL)
#define MMC_ESTM_POS_VAL_SHIFT (0U)
#define MMC_ESTM_POS_VAL_GET(x) (((uint32_t)(x) & MMC_ESTM_POS_VAL_MASK) >> MMC_ESTM_POS_VAL_SHIFT)

/* Bitfield definition for register: ESTM_REV */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_ESTM_REV_VAL_MASK (0xFFFFFFFFUL)
#define MMC_ESTM_REV_VAL_SHIFT (0U)
#define MMC_ESTM_REV_VAL_GET(x) (((uint32_t)(x) & MMC_ESTM_REV_VAL_MASK) >> MMC_ESTM_REV_VAL_SHIFT)

/* Bitfield definition for register: ESTM_SPEED */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_ESTM_SPEED_VAL_MASK (0xFFFFFFFFUL)
#define MMC_ESTM_SPEED_VAL_SHIFT (0U)
#define MMC_ESTM_SPEED_VAL_GET(x) (((uint32_t)(x) & MMC_ESTM_SPEED_VAL_MASK) >> MMC_ESTM_SPEED_VAL_SHIFT)

/* Bitfield definition for register: ESTM_ACCEL */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_ESTM_ACCEL_VAL_MASK (0xFFFFFFFFUL)
#define MMC_ESTM_ACCEL_VAL_SHIFT (0U)
#define MMC_ESTM_ACCEL_VAL_GET(x) (((uint32_t)(x) & MMC_ESTM_ACCEL_VAL_MASK) >> MMC_ESTM_ACCEL_VAL_SHIFT)

/* Bitfield definition for register: CUR_PCOEF */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_CUR_PCOEF_VAL_MASK (0xFFFFFFFFUL)
#define MMC_CUR_PCOEF_VAL_SHIFT (0U)
#define MMC_CUR_PCOEF_VAL_GET(x) (((uint32_t)(x) & MMC_CUR_PCOEF_VAL_MASK) >> MMC_CUR_PCOEF_VAL_SHIFT)

/* Bitfield definition for register: CUR_ICOEF */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_CUR_ICOEF_VAL_MASK (0xFFFFFFFFUL)
#define MMC_CUR_ICOEF_VAL_SHIFT (0U)
#define MMC_CUR_ICOEF_VAL_GET(x) (((uint32_t)(x) & MMC_CUR_ICOEF_VAL_MASK) >> MMC_CUR_ICOEF_VAL_SHIFT)

/* Bitfield definition for register: CUR_ACOEF */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_CUR_ACOEF_VAL_MASK (0xFFFFFFFFUL)
#define MMC_CUR_ACOEF_VAL_SHIFT (0U)
#define MMC_CUR_ACOEF_VAL_GET(x) (((uint32_t)(x) & MMC_CUR_ACOEF_VAL_MASK) >> MMC_CUR_ACOEF_VAL_SHIFT)

/* Bitfield definition for register: INI_DELTA_POS_TIME */
/*
 * VAL (RW)
 *
 * indicate the time to change the values.
 * 0: instant change
 */
#define MMC_INI_DELTA_POS_TIME_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_DELTA_POS_TIME_VAL_SHIFT (0U)
#define MMC_INI_DELTA_POS_TIME_VAL_SET(x) (((uint32_t)(x) << MMC_INI_DELTA_POS_TIME_VAL_SHIFT) & MMC_INI_DELTA_POS_TIME_VAL_MASK)
#define MMC_INI_DELTA_POS_TIME_VAL_GET(x) (((uint32_t)(x) & MMC_INI_DELTA_POS_TIME_VAL_MASK) >> MMC_INI_DELTA_POS_TIME_VAL_SHIFT)

/* Bitfield definition for register: INI_DELTA_POS */
/*
 * VAL (RW)
 *
 * the value
 * continuous mode: ufix <32, 32>
 */
#define MMC_INI_DELTA_POS_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_DELTA_POS_VAL_SHIFT (0U)
#define MMC_INI_DELTA_POS_VAL_SET(x) (((uint32_t)(x) << MMC_INI_DELTA_POS_VAL_SHIFT) & MMC_INI_DELTA_POS_VAL_MASK)
#define MMC_INI_DELTA_POS_VAL_GET(x) (((uint32_t)(x) & MMC_INI_DELTA_POS_VAL_MASK) >> MMC_INI_DELTA_POS_VAL_SHIFT)

/* Bitfield definition for register: INI_DELTA_REV */
/*
 * VAL (RW)
 *
 * the value
 * continuous mode: fix<32, 0>
 */
#define MMC_INI_DELTA_REV_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_DELTA_REV_VAL_SHIFT (0U)
#define MMC_INI_DELTA_REV_VAL_SET(x) (((uint32_t)(x) << MMC_INI_DELTA_REV_VAL_SHIFT) & MMC_INI_DELTA_REV_VAL_MASK)
#define MMC_INI_DELTA_REV_VAL_GET(x) (((uint32_t)(x) & MMC_INI_DELTA_REV_VAL_MASK) >> MMC_INI_DELTA_REV_VAL_SHIFT)

/* Bitfield definition for register: INI_DELTA_SPEED */
/*
 * VAL (RW)
 *
 * the value；
 * continuous mode: fix<32, 19>
 */
#define MMC_INI_DELTA_SPEED_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_DELTA_SPEED_VAL_SHIFT (0U)
#define MMC_INI_DELTA_SPEED_VAL_SET(x) (((uint32_t)(x) << MMC_INI_DELTA_SPEED_VAL_SHIFT) & MMC_INI_DELTA_SPEED_VAL_MASK)
#define MMC_INI_DELTA_SPEED_VAL_GET(x) (((uint32_t)(x) & MMC_INI_DELTA_SPEED_VAL_MASK) >> MMC_INI_DELTA_SPEED_VAL_SHIFT)

