hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_mmc_regs.h
/* Bitfield definition for register: INI_DELTA_ACCEL */
/*
 * VAL (RW)
 *
 * the value
 * continuous mode: fix<32, 19>
 */
#define MMC_INI_DELTA_ACCEL_VAL_MASK (0xFFFFFFFFUL)
#define MMC_INI_DELTA_ACCEL_VAL_SHIFT (0U)
#define MMC_INI_DELTA_ACCEL_VAL_SET(x) (((uint32_t)(x) << MMC_INI_DELTA_ACCEL_VAL_SHIFT) & MMC_INI_DELTA_ACCEL_VAL_MASK)
#define MMC_INI_DELTA_ACCEL_VAL_GET(x) (((uint32_t)(x) & MMC_INI_DELTA_ACCEL_VAL_MASK) >> MMC_INI_DELTA_ACCEL_VAL_SHIFT)

/* Bitfield definition for register: POS_TRG_CFG */
/*
 * EDGE (RW)
 *
 * 0: (rising edge) pos inc greater than, 1: (falling edge)  pos dec less than
 */
#define MMC_POS_TRG_CFG_EDGE_MASK (0x2U)
#define MMC_POS_TRG_CFG_EDGE_SHIFT (1U)
#define MMC_POS_TRG_CFG_EDGE_SET(x) (((uint32_t)(x) << MMC_POS_TRG_CFG_EDGE_SHIFT) & MMC_POS_TRG_CFG_EDGE_MASK)
#define MMC_POS_TRG_CFG_EDGE_GET(x) (((uint32_t)(x) & MMC_POS_TRG_CFG_EDGE_MASK) >> MMC_POS_TRG_CFG_EDGE_SHIFT)

/*
 * EN (RW)
 *
 * 1-trigger valid; 0-Trigger not valid"
 */
#define MMC_POS_TRG_CFG_EN_MASK (0x1U)
#define MMC_POS_TRG_CFG_EN_SHIFT (0U)
#define MMC_POS_TRG_CFG_EN_SET(x) (((uint32_t)(x) << MMC_POS_TRG_CFG_EN_SHIFT) & MMC_POS_TRG_CFG_EN_MASK)
#define MMC_POS_TRG_CFG_EN_GET(x) (((uint32_t)(x) & MMC_POS_TRG_CFG_EN_MASK) >> MMC_POS_TRG_CFG_EN_SHIFT)

/* Bitfield definition for register: POS_TRG_POS_THR */
/*
 * VAL (RW)
 *
 * For pos out trigger (pos).
 * ufix<32, 32>
 */
#define MMC_POS_TRG_POS_THR_VAL_MASK (0xFFFFFFFFUL)
#define MMC_POS_TRG_POS_THR_VAL_SHIFT (0U)
#define MMC_POS_TRG_POS_THR_VAL_SET(x) (((uint32_t)(x) << MMC_POS_TRG_POS_THR_VAL_SHIFT) & MMC_POS_TRG_POS_THR_VAL_MASK)
#define MMC_POS_TRG_POS_THR_VAL_GET(x) (((uint32_t)(x) & MMC_POS_TRG_POS_THR_VAL_MASK) >> MMC_POS_TRG_POS_THR_VAL_SHIFT)

/* Bitfield definition for register: POS_TRG_REV_THR */
/*
 * VAL (RW)
 *
 * For pos out trigger (rev)
 * fix<32, 0>
 */
#define MMC_POS_TRG_REV_THR_VAL_MASK (0xFFFFFFFFUL)
#define MMC_POS_TRG_REV_THR_VAL_SHIFT (0U)
#define MMC_POS_TRG_REV_THR_VAL_SET(x) (((uint32_t)(x) << MMC_POS_TRG_REV_THR_VAL_SHIFT) & MMC_POS_TRG_REV_THR_VAL_MASK)
#define MMC_POS_TRG_REV_THR_VAL_GET(x) (((uint32_t)(x) & MMC_POS_TRG_REV_THR_VAL_MASK) >> MMC_POS_TRG_REV_THR_VAL_SHIFT)

/* Bitfield definition for register: SPEED_TRG_CFG */
/*
 * COMP_TYPE (RW)
 *
 * 1: Use abs value for comparion. 0: Use the speed with direction info (so not the abs value)
 */
#define MMC_SPEED_TRG_CFG_COMP_TYPE_MASK (0x4U)
#define MMC_SPEED_TRG_CFG_COMP_TYPE_SHIFT (2U)
#define MMC_SPEED_TRG_CFG_COMP_TYPE_SET(x) (((uint32_t)(x) << MMC_SPEED_TRG_CFG_COMP_TYPE_SHIFT) & MMC_SPEED_TRG_CFG_COMP_TYPE_MASK)
#define MMC_SPEED_TRG_CFG_COMP_TYPE_GET(x) (((uint32_t)(x) & MMC_SPEED_TRG_CFG_COMP_TYPE_MASK) >> MMC_SPEED_TRG_CFG_COMP_TYPE_SHIFT)

/*
 * EDGE (RW)
 *
 * 0: (rising edge) speed inc greater than, 1: (falling edge)  speed dec less than
 */
#define MMC_SPEED_TRG_CFG_EDGE_MASK (0x2U)
#define MMC_SPEED_TRG_CFG_EDGE_SHIFT (1U)
#define MMC_SPEED_TRG_CFG_EDGE_SET(x) (((uint32_t)(x) << MMC_SPEED_TRG_CFG_EDGE_SHIFT) & MMC_SPEED_TRG_CFG_EDGE_MASK)
#define MMC_SPEED_TRG_CFG_EDGE_GET(x) (((uint32_t)(x) & MMC_SPEED_TRG_CFG_EDGE_MASK) >> MMC_SPEED_TRG_CFG_EDGE_SHIFT)

/*
 * EN (RW)
 *
 * 1-trigger valid; 0-Trigger not valid
 * Normally it means either the max pos speed, or the min negative speed.
 */
#define MMC_SPEED_TRG_CFG_EN_MASK (0x1U)
#define MMC_SPEED_TRG_CFG_EN_SHIFT (0U)
#define MMC_SPEED_TRG_CFG_EN_SET(x) (((uint32_t)(x) << MMC_SPEED_TRG_CFG_EN_SHIFT) & MMC_SPEED_TRG_CFG_EN_MASK)
#define MMC_SPEED_TRG_CFG_EN_GET(x) (((uint32_t)(x) & MMC_SPEED_TRG_CFG_EN_MASK) >> MMC_SPEED_TRG_CFG_EN_SHIFT)

/* Bitfield definition for register: SPEED_TRG_THR */
/*
 * VAL (RW)
 *
 * For speed trigger.
 * continuous mode: fix<32, 19>
 */
#define MMC_SPEED_TRG_THR_VAL_MASK (0xFFFFFFFFUL)
#define MMC_SPEED_TRG_THR_VAL_SHIFT (0U)
#define MMC_SPEED_TRG_THR_VAL_SET(x) (((uint32_t)(x) << MMC_SPEED_TRG_THR_VAL_SHIFT) & MMC_SPEED_TRG_THR_VAL_MASK)
#define MMC_SPEED_TRG_THR_VAL_GET(x) (((uint32_t)(x) & MMC_SPEED_TRG_THR_VAL_MASK) >> MMC_SPEED_TRG_THR_VAL_SHIFT)

/* Bitfield definition for register of struct array COEF_TRG_CFG: ERR_THR */
/*
 * VAL (RW)
 *
 * ErrThr0: Error Threshold 0, (abs(tracking error)>= will choose the coefs as below)
 * Note: ErrThr0>ErrThr1>ErrThr2
 * ufix<31, 28>
 */
#define MMC_COEF_TRG_CFG_ERR_THR_VAL_MASK (0xFFFFFFFFUL)
#define MMC_COEF_TRG_CFG_ERR_THR_VAL_SHIFT (0U)
#define MMC_COEF_TRG_CFG_ERR_THR_VAL_SET(x) (((uint32_t)(x) << MMC_COEF_TRG_CFG_ERR_THR_VAL_SHIFT) & MMC_COEF_TRG_CFG_ERR_THR_VAL_MASK)
#define MMC_COEF_TRG_CFG_ERR_THR_VAL_GET(x) (((uint32_t)(x) & MMC_COEF_TRG_CFG_ERR_THR_VAL_MASK) >> MMC_COEF_TRG_CFG_ERR_THR_VAL_SHIFT)

/* Bitfield definition for register of struct array COEF_TRG_CFG: P */
/*
 * VAL (RW)
 *
 * P0_Coef, fix<32, 15>
 */
#define MMC_COEF_TRG_CFG_P_VAL_MASK (0xFFFFFFFFUL)
#define MMC_COEF_TRG_CFG_P_VAL_SHIFT (0U)
#define MMC_COEF_TRG_CFG_P_VAL_SET(x) (((uint32_t)(x) << MMC_COEF_TRG_CFG_P_VAL_SHIFT) & MMC_COEF_TRG_CFG_P_VAL_MASK)
#define MMC_COEF_TRG_CFG_P_VAL_GET(x) (((uint32_t)(x) & MMC_COEF_TRG_CFG_P_VAL_MASK) >> MMC_COEF_TRG_CFG_P_VAL_SHIFT)

/* Bitfield definition for register of struct array COEF_TRG_CFG: I */
/*
 * VAL (RW)
 *
 * I0_Coef, fix<32, 21>
 */
#define MMC_COEF_TRG_CFG_I_VAL_MASK (0xFFFFFFFFUL)
#define MMC_COEF_TRG_CFG_I_VAL_SHIFT (0U)
#define MMC_COEF_TRG_CFG_I_VAL_SET(x) (((uint32_t)(x) << MMC_COEF_TRG_CFG_I_VAL_SHIFT) & MMC_COEF_TRG_CFG_I_VAL_MASK)
#define MMC_COEF_TRG_CFG_I_VAL_GET(x) (((uint32_t)(x) & MMC_COEF_TRG_CFG_I_VAL_MASK) >> MMC_COEF_TRG_CFG_I_VAL_SHIFT)

/* Bitfield definition for register of struct array COEF_TRG_CFG: A */
/*
 * VAL (RW)
 *
 * A0_Coef，fix<32, 19>
 */
#define MMC_COEF_TRG_CFG_A_VAL_MASK (0xFFFFFFFFUL)
#define MMC_COEF_TRG_CFG_A_VAL_SHIFT (0U)
#define MMC_COEF_TRG_CFG_A_VAL_SET(x) (((uint32_t)(x) << MMC_COEF_TRG_CFG_A_VAL_SHIFT) & MMC_COEF_TRG_CFG_A_VAL_MASK)
#define MMC_COEF_TRG_CFG_A_VAL_GET(x) (((uint32_t)(x) & MMC_COEF_TRG_CFG_A_VAL_MASK) >> MMC_COEF_TRG_CFG_A_VAL_SHIFT)

/* Bitfield definition for register of struct array COEF_TRG_CFG: TIME */
/*
 * VAL (RW)
 *
 * CoefTime0: Time Stayed using this coefs (counted in input samples). Ideal value of tracing cycles should +1. ufix<32,0>
 */
#define MMC_COEF_TRG_CFG_TIME_VAL_MASK (0xFFFFFFFFUL)
#define MMC_COEF_TRG_CFG_TIME_VAL_SHIFT (0U)
#define MMC_COEF_TRG_CFG_TIME_VAL_SET(x) (((uint32_t)(x) << MMC_COEF_TRG_CFG_TIME_VAL_SHIFT) & MMC_COEF_TRG_CFG_TIME_VAL_MASK)
#define MMC_COEF_TRG_CFG_TIME_VAL_GET(x) (((uint32_t)(x) & MMC_COEF_TRG_CFG_TIME_VAL_MASK) >> MMC_COEF_TRG_CFG_TIME_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_CTRL */
/*
 * SPEED_TRG_VALID_IE (RW)
 *
 * Interrupt Enable for SPEED_TRG_VALID
 */
#define MMC_BR_BR_CTRL_SPEED_TRG_VALID_IE_MASK (0x40000000UL)
#define MMC_BR_BR_CTRL_SPEED_TRG_VALID_IE_SHIFT (30U)
#define MMC_BR_BR_CTRL_SPEED_TRG_VALID_IE_SET(x) (((uint32_t)(x) << MMC_BR_BR_CTRL_SPEED_TRG_VALID_IE_SHIFT) & MMC_BR_BR_CTRL_SPEED_TRG_VALID_IE_MASK)
#define MMC_BR_BR_CTRL_SPEED_TRG_VALID_IE_GET(x) (((uint32_t)(x) & MMC_BR_BR_CTRL_SPEED_TRG_VALID_IE_MASK) >> MMC_BR_BR_CTRL_SPEED_TRG_VALID_IE_SHIFT)

