hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_mmc_regs.h
/*
 * POS_TRG_VALID_IE (RW)
 *
 * Interrupt Enable for POS_TRG_VALID
 */
#define MMC_BR_BR_CTRL_POS_TRG_VALID_IE_MASK (0x20000000UL)
#define MMC_BR_BR_CTRL_POS_TRG_VALID_IE_SHIFT (29U)
#define MMC_BR_BR_CTRL_POS_TRG_VALID_IE_SET(x) (((uint32_t)(x) << MMC_BR_BR_CTRL_POS_TRG_VALID_IE_SHIFT) & MMC_BR_BR_CTRL_POS_TRG_VALID_IE_MASK)
#define MMC_BR_BR_CTRL_POS_TRG_VALID_IE_GET(x) (((uint32_t)(x) & MMC_BR_BR_CTRL_POS_TRG_VALID_IE_MASK) >> MMC_BR_BR_CTRL_POS_TRG_VALID_IE_SHIFT)

/*
 * INI_POS_TRG_TYPE (RW)
 *
 * 0: Time Stamp in the configuration
 * 1: Risedge of In Trg[0]
 * 2: Risedge of In Trg[1]
 * 3: Risedge of out trg[0]
 * 4: Risedge of out trg[1]
 * 5: Risedge of self pos trigger
 * 6: Risedge of self speed trigger
 * Others: no function
 */
#define MMC_BR_BR_CTRL_INI_POS_TRG_TYPE_MASK (0x3800000UL)
#define MMC_BR_BR_CTRL_INI_POS_TRG_TYPE_SHIFT (23U)
#define MMC_BR_BR_CTRL_INI_POS_TRG_TYPE_SET(x) (((uint32_t)(x) << MMC_BR_BR_CTRL_INI_POS_TRG_TYPE_SHIFT) & MMC_BR_BR_CTRL_INI_POS_TRG_TYPE_MASK)
#define MMC_BR_BR_CTRL_INI_POS_TRG_TYPE_GET(x) (((uint32_t)(x) & MMC_BR_BR_CTRL_INI_POS_TRG_TYPE_MASK) >> MMC_BR_BR_CTRL_INI_POS_TRG_TYPE_SHIFT)

/*
 * INI_POS_CMD_MSK (RW)
 *
 * 1: change
 * 0: won't change
 * bit 3: for accel
 * bit 2: for speed
 * bit 1: for revolution
 * bit 0: for position
 */
#define MMC_BR_BR_CTRL_INI_POS_CMD_MSK_MASK (0x3C0000UL)
#define MMC_BR_BR_CTRL_INI_POS_CMD_MSK_SHIFT (18U)
#define MMC_BR_BR_CTRL_INI_POS_CMD_MSK_SET(x) (((uint32_t)(x) << MMC_BR_BR_CTRL_INI_POS_CMD_MSK_SHIFT) & MMC_BR_BR_CTRL_INI_POS_CMD_MSK_MASK)
#define MMC_BR_BR_CTRL_INI_POS_CMD_MSK_GET(x) (((uint32_t)(x) & MMC_BR_BR_CTRL_INI_POS_CMD_MSK_MASK) >> MMC_BR_BR_CTRL_INI_POS_CMD_MSK_SHIFT)

/*
 * INI_DELTA_POS_TRG_TYPE (RW)
 *
 * 0: Time Stamp in the configuration
 * 1: Risedge of In Trg[0]
 * 2: Risedge of In Trg[1]
 * 3: Risedge of out trg[0]
 * 4: Risedge of out trg[1]
 * 5: Risedge of self pos trigger
 * 6: Risedge of self speed trigger
 * Others: no function
 */
#define MMC_BR_BR_CTRL_INI_DELTA_POS_TRG_TYPE_MASK (0x1C000UL)
#define MMC_BR_BR_CTRL_INI_DELTA_POS_TRG_TYPE_SHIFT (14U)
#define MMC_BR_BR_CTRL_INI_DELTA_POS_TRG_TYPE_SET(x) (((uint32_t)(x) << MMC_BR_BR_CTRL_INI_DELTA_POS_TRG_TYPE_SHIFT) & MMC_BR_BR_CTRL_INI_DELTA_POS_TRG_TYPE_MASK)
#define MMC_BR_BR_CTRL_INI_DELTA_POS_TRG_TYPE_GET(x) (((uint32_t)(x) & MMC_BR_BR_CTRL_INI_DELTA_POS_TRG_TYPE_MASK) >> MMC_BR_BR_CTRL_INI_DELTA_POS_TRG_TYPE_SHIFT)

/*
 * INI_DELTA_POS_DONE_IE (RW)
 *
 * Interrupt Enable for INI_DELTA_POS_DONE
 */
#define MMC_BR_BR_CTRL_INI_DELTA_POS_DONE_IE_MASK (0x2000U)
#define MMC_BR_BR_CTRL_INI_DELTA_POS_DONE_IE_SHIFT (13U)
#define MMC_BR_BR_CTRL_INI_DELTA_POS_DONE_IE_SET(x) (((uint32_t)(x) << MMC_BR_BR_CTRL_INI_DELTA_POS_DONE_IE_SHIFT) & MMC_BR_BR_CTRL_INI_DELTA_POS_DONE_IE_MASK)
#define MMC_BR_BR_CTRL_INI_DELTA_POS_DONE_IE_GET(x) (((uint32_t)(x) & MMC_BR_BR_CTRL_INI_DELTA_POS_DONE_IE_MASK) >> MMC_BR_BR_CTRL_INI_DELTA_POS_DONE_IE_SHIFT)

/*
 * INI_DELTA_POS_CMD_MSK (RW)
 *
 * 1: change
 * 0: won't change
 * bit 3: for delta accel
 * bit 2: for delta speed
 * bit 1: for delta revolution
 * bit 0: for delta position
 */
#define MMC_BR_BR_CTRL_INI_DELTA_POS_CMD_MSK_MASK (0x1E00U)
#define MMC_BR_BR_CTRL_INI_DELTA_POS_CMD_MSK_SHIFT (9U)
#define MMC_BR_BR_CTRL_INI_DELTA_POS_CMD_MSK_SET(x) (((uint32_t)(x) << MMC_BR_BR_CTRL_INI_DELTA_POS_CMD_MSK_SHIFT) & MMC_BR_BR_CTRL_INI_DELTA_POS_CMD_MSK_MASK)
#define MMC_BR_BR_CTRL_INI_DELTA_POS_CMD_MSK_GET(x) (((uint32_t)(x) & MMC_BR_BR_CTRL_INI_DELTA_POS_CMD_MSK_MASK) >> MMC_BR_BR_CTRL_INI_DELTA_POS_CMD_MSK_SHIFT)

/*
 * INI_DELTA_POS_REQ (RW)
 *
 * 1: Command to reload the delta pos. Auto clear
 * 0:
 */
#define MMC_BR_BR_CTRL_INI_DELTA_POS_REQ_MASK (0x100U)
#define MMC_BR_BR_CTRL_INI_DELTA_POS_REQ_SHIFT (8U)
#define MMC_BR_BR_CTRL_INI_DELTA_POS_REQ_SET(x) (((uint32_t)(x) << MMC_BR_BR_CTRL_INI_DELTA_POS_REQ_SHIFT) & MMC_BR_BR_CTRL_INI_DELTA_POS_REQ_MASK)
#define MMC_BR_BR_CTRL_INI_DELTA_POS_REQ_GET(x) (((uint32_t)(x) & MMC_BR_BR_CTRL_INI_DELTA_POS_REQ_MASK) >> MMC_BR_BR_CTRL_INI_DELTA_POS_REQ_SHIFT)

/*
 * OPEN_LOOP_MODE (RW)
 *
 * 1: in open loop mode
 * 0: not in open loop mode
 */
#define MMC_BR_BR_CTRL_OPEN_LOOP_MODE_MASK (0x80U)
#define MMC_BR_BR_CTRL_OPEN_LOOP_MODE_SHIFT (7U)
#define MMC_BR_BR_CTRL_OPEN_LOOP_MODE_SET(x) (((uint32_t)(x) << MMC_BR_BR_CTRL_OPEN_LOOP_MODE_SHIFT) & MMC_BR_BR_CTRL_OPEN_LOOP_MODE_MASK)
#define MMC_BR_BR_CTRL_OPEN_LOOP_MODE_GET(x) (((uint32_t)(x) & MMC_BR_BR_CTRL_OPEN_LOOP_MODE_MASK) >> MMC_BR_BR_CTRL_OPEN_LOOP_MODE_SHIFT)

/*
 * PRED_MODE (RW)
 *
 * 1:continuously repeat pred,
 * 0:cal the pred based on a definite time-stamp offset,
 * 2:programed one-shot prediction mode
 */
#define MMC_BR_BR_CTRL_PRED_MODE_MASK (0x30U)
#define MMC_BR_BR_CTRL_PRED_MODE_SHIFT (4U)
#define MMC_BR_BR_CTRL_PRED_MODE_SET(x) (((uint32_t)(x) << MMC_BR_BR_CTRL_PRED_MODE_SHIFT) & MMC_BR_BR_CTRL_PRED_MODE_MASK)
#define MMC_BR_BR_CTRL_PRED_MODE_GET(x) (((uint32_t)(x) & MMC_BR_BR_CTRL_PRED_MODE_MASK) >> MMC_BR_BR_CTRL_PRED_MODE_SHIFT)

/*
 * NF_TRG_TYPE (RW)
 *
 * 1. Each non-first trigger by external trigger pin
 * 0. Each non-first trigger by the timer
 */
#define MMC_BR_BR_CTRL_NF_TRG_TYPE_MASK (0x4U)
#define MMC_BR_BR_CTRL_NF_TRG_TYPE_SHIFT (2U)
#define MMC_BR_BR_CTRL_NF_TRG_TYPE_SET(x) (((uint32_t)(x) << MMC_BR_BR_CTRL_NF_TRG_TYPE_SHIFT) & MMC_BR_BR_CTRL_NF_TRG_TYPE_MASK)
#define MMC_BR_BR_CTRL_NF_TRG_TYPE_GET(x) (((uint32_t)(x) & MMC_BR_BR_CTRL_NF_TRG_TYPE_MASK) >> MMC_BR_BR_CTRL_NF_TRG_TYPE_SHIFT)

/*
 * F_TRG_TYPE (RW)
 *
 * 1. First trigger by external trigger pin
 * 0. First trigger by the timer
 * When in CR[MANUAL_IO]=1 mode, it is the prediction trigger
 */
#define MMC_BR_BR_CTRL_F_TRG_TYPE_MASK (0x2U)
#define MMC_BR_BR_CTRL_F_TRG_TYPE_SHIFT (1U)
#define MMC_BR_BR_CTRL_F_TRG_TYPE_SET(x) (((uint32_t)(x) << MMC_BR_BR_CTRL_F_TRG_TYPE_SHIFT) & MMC_BR_BR_CTRL_F_TRG_TYPE_MASK)
#define MMC_BR_BR_CTRL_F_TRG_TYPE_GET(x) (((uint32_t)(x) & MMC_BR_BR_CTRL_F_TRG_TYPE_MASK) >> MMC_BR_BR_CTRL_F_TRG_TYPE_SHIFT)

