hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_mmc_regs.h
/* Bitfield definition for register of struct array BR: BR_INI_DELTA_ACCEL */
/*
 * VAL (RW)
 *
 * the value
 * continuous mode: fix<32, 19>
 */
#define MMC_BR_BR_INI_DELTA_ACCEL_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_INI_DELTA_ACCEL_VAL_SHIFT (0U)
#define MMC_BR_BR_INI_DELTA_ACCEL_VAL_SET(x) (((uint32_t)(x) << MMC_BR_BR_INI_DELTA_ACCEL_VAL_SHIFT) & MMC_BR_BR_INI_DELTA_ACCEL_VAL_MASK)
#define MMC_BR_BR_INI_DELTA_ACCEL_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_INI_DELTA_ACCEL_VAL_MASK) >> MMC_BR_BR_INI_DELTA_ACCEL_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_CUR_POS_TIME */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BR_BR_CUR_POS_TIME_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_CUR_POS_TIME_VAL_SHIFT (0U)
#define MMC_BR_BR_CUR_POS_TIME_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_CUR_POS_TIME_VAL_MASK) >> MMC_BR_BR_CUR_POS_TIME_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_CUR_POS */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BR_BR_CUR_POS_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_CUR_POS_VAL_SHIFT (0U)
#define MMC_BR_BR_CUR_POS_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_CUR_POS_VAL_MASK) >> MMC_BR_BR_CUR_POS_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_CUR_REV */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BR_BR_CUR_REV_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_CUR_REV_VAL_SHIFT (0U)
#define MMC_BR_BR_CUR_REV_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_CUR_REV_VAL_MASK) >> MMC_BR_BR_CUR_REV_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_CUR_SPEED */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BR_BR_CUR_SPEED_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_CUR_SPEED_VAL_SHIFT (0U)
#define MMC_BR_BR_CUR_SPEED_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_CUR_SPEED_VAL_MASK) >> MMC_BR_BR_CUR_SPEED_VAL_SHIFT)

/* Bitfield definition for register of struct array BR: BR_CUR_ACCEL */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BR_BR_CUR_ACCEL_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BR_BR_CUR_ACCEL_VAL_SHIFT (0U)
#define MMC_BR_BR_CUR_ACCEL_VAL_GET(x) (((uint32_t)(x) & MMC_BR_BR_CUR_ACCEL_VAL_MASK) >> MMC_BR_BR_CUR_ACCEL_VAL_SHIFT)

/* Bitfield definition for register: BK0_TIMESTAMP */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BK0_TIMESTAMP_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BK0_TIMESTAMP_VAL_SHIFT (0U)
#define MMC_BK0_TIMESTAMP_VAL_GET(x) (((uint32_t)(x) & MMC_BK0_TIMESTAMP_VAL_MASK) >> MMC_BK0_TIMESTAMP_VAL_SHIFT)

/* Bitfield definition for register: BK0_POSITION */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BK0_POSITION_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BK0_POSITION_VAL_SHIFT (0U)
#define MMC_BK0_POSITION_VAL_GET(x) (((uint32_t)(x) & MMC_BK0_POSITION_VAL_MASK) >> MMC_BK0_POSITION_VAL_SHIFT)

/* Bitfield definition for register: BK0_REVOLUTION */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BK0_REVOLUTION_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BK0_REVOLUTION_VAL_SHIFT (0U)
#define MMC_BK0_REVOLUTION_VAL_GET(x) (((uint32_t)(x) & MMC_BK0_REVOLUTION_VAL_MASK) >> MMC_BK0_REVOLUTION_VAL_SHIFT)

/* Bitfield definition for register: BK0_SPEED */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BK0_SPEED_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BK0_SPEED_VAL_SHIFT (0U)
#define MMC_BK0_SPEED_VAL_GET(x) (((uint32_t)(x) & MMC_BK0_SPEED_VAL_MASK) >> MMC_BK0_SPEED_VAL_SHIFT)

/* Bitfield definition for register: BK0_ACCELERATOR */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BK0_ACCELERATOR_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BK0_ACCELERATOR_VAL_SHIFT (0U)
#define MMC_BK0_ACCELERATOR_VAL_GET(x) (((uint32_t)(x) & MMC_BK0_ACCELERATOR_VAL_MASK) >> MMC_BK0_ACCELERATOR_VAL_SHIFT)

/* Bitfield definition for register: BK1_TIMESTAMP */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BK1_TIMESTAMP_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BK1_TIMESTAMP_VAL_SHIFT (0U)
#define MMC_BK1_TIMESTAMP_VAL_GET(x) (((uint32_t)(x) & MMC_BK1_TIMESTAMP_VAL_MASK) >> MMC_BK1_TIMESTAMP_VAL_SHIFT)

/* Bitfield definition for register: BK1_POSITION */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BK1_POSITION_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BK1_POSITION_VAL_SHIFT (0U)
#define MMC_BK1_POSITION_VAL_GET(x) (((uint32_t)(x) & MMC_BK1_POSITION_VAL_MASK) >> MMC_BK1_POSITION_VAL_SHIFT)

/* Bitfield definition for register: BK1_REVOLUTION */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BK1_REVOLUTION_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BK1_REVOLUTION_VAL_SHIFT (0U)
#define MMC_BK1_REVOLUTION_VAL_GET(x) (((uint32_t)(x) & MMC_BK1_REVOLUTION_VAL_MASK) >> MMC_BK1_REVOLUTION_VAL_SHIFT)

/* Bitfield definition for register: BK1_SPEED */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BK1_SPEED_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BK1_SPEED_VAL_SHIFT (0U)
#define MMC_BK1_SPEED_VAL_GET(x) (((uint32_t)(x) & MMC_BK1_SPEED_VAL_MASK) >> MMC_BK1_SPEED_VAL_SHIFT)

/* Bitfield definition for register: BK1_ACCELERATOR */
/*
 * VAL (RO)
 *
 * the value
 */
#define MMC_BK1_ACCELERATOR_VAL_MASK (0xFFFFFFFFUL)
#define MMC_BK1_ACCELERATOR_VAL_SHIFT (0U)
#define MMC_BK1_ACCELERATOR_VAL_GET(x) (((uint32_t)(x) & MMC_BK1_ACCELERATOR_VAL_MASK) >> MMC_BK1_ACCELERATOR_VAL_SHIFT)



/* COEF_TRG_CFG register group index macro definition */
#define MMC_COEF_TRG_CFG_0 (0UL)
#define MMC_COEF_TRG_CFG_1 (1UL)
#define MMC_COEF_TRG_CFG_2 (2UL)

/* BR register group index macro definition */
#define MMC_BR_0 (0UL)
#define MMC_BR_1 (1UL)


#endif /* HPM_MMC_H */
